<?php

namespace Interpro\Extractor\Test;

trait TestCaseTrait
{
    public function getCase()
    {
        $case = [
            'block_birds' => [
                'owns' => [
                    'descr' => 'Потомки динозавров, имеют перья, летают.', 'title' => 'Птицы'
                ]
            ],
            'group_bird_type' => [
                [
                    'owns' => ['id' => 1, 'descr' => 'Все представители этого семейства хорошо плавают и ныряют.', 'title' => 'Пингвиновые'],
                    'refs' => ['example' => 10]
                ],
                [
                    'owns' => ['id' => 2, 'descr' => 'У них крепкие лапы, приспособленные для быстрого бега и рытья земли.', 'title' => 'Курообразные'],
                    'refs' => ['example' => 30]
                ],
                [
                    'owns' => ['id' => 3, 'descr' => 'Гуси, утки, лебеди.', 'title' => 'Гусеобразные'],
                    'refs' => ['example' => 50]
                ]
            ],
            'group_bird_class' => [
                [
                    'owns' => ['id' => 10, 'descr' => 'Самый крупный и тяжёлый из современных видов семейства.', 'title' => 'Императорский'],
                    'refs' => ['superior' => 1]
                ],
                [
                    'owns' => ['id' => 20, 'descr' => 'Один из самых распространенных видов.', 'title' => 'Адели'],
                    'refs' => ['superior' => 1]
                ],
                [
                    'owns' => ['id' => 30, 'descr' => 'Оседлая либо кочующая птица.', 'title' => 'Тетерев'],
                    'refs' => ['superior' => 2]
                ],
                [
                    'owns' => ['id' => 40, 'descr' => 'Все эти признаки для фазановых в равной мере характерны, как и для курообразных вообще.', 'title' => 'Фазан'],
                    'refs' => ['superior' => 2]
                ],
                [
                    'owns' => ['id' => 50, 'descr' => 'Гуси отличаются клювом, имеющим при основании большую высоту, чем ширину, и оканчивающимся ноготком с острым краем.', 'title' => 'Гусь'],
                    'refs' => ['superior' => 3]
                ],
                [
                    'owns' => ['id' => 60, 'descr' => 'Птицы средних и небольших размеров с относительно короткой шеей .', 'title' => 'Утка'],
                    'refs' => ['superior' => 3]
                ]
            ],
            'group_bird_area' => [
                [
                    'owns' => ['id' => 100],
                    'refs' => ['superior' => 10, 'area' => 33]
                ],
                [
                    'owns' => ['id' => 200],
                    'refs' => ['superior' => 20, 'area' => 33]
                ],
                [
                    'owns' => ['id' => 300],
                    'refs' => ['superior' => 30, 'area' => 22]
                ],
                [
                    'owns' => ['id' => 400],
                    'refs' => ['superior' => 40, 'area' => 22]
                ],
                [
                    'owns' => ['id' => 500],
                    'refs' => ['superior' => 50, 'area' => 22]
                ],
                [
                    'owns' => ['id' => 600],
                    'refs' => ['superior' => 50, 'area' => 11]
                ],
                [
                    'owns' => ['id' => 700],
                    'refs' => ['superior' => 60, 'area' => 22]
                ]
            ],

            'block_areas' => [
                'owns' => [
                    'descr' => 'Ареал обитания птиц, описание локаций.', 'title' => 'Ареал обитания'
                ]
            ],
            'group_area' => [
                [
                    'owns' => ['id' => 11, 'descr' => 'Влажные леса на разных континентах.', 'title' => 'Тропики'],
                ],
                [
                    'owns' => ['id' => 22, 'descr' => 'Северные широты евразии и америки.', 'title' => 'Север'],
                ],
                [
                    'owns' => ['id' => 33, 'descr' => 'Антарктида и острова вокруг.', 'title' => 'Антарктика']
                ],
            ]
        ];

        return $case;
    }

}
